---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.Rounding
source: html/c667f851-039f-eecf-252c-785ab187ce1e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.Rounding Property

Increment to which numeric values of analysis results are rounded in markers.

## Syntax (C#)
```csharp
public double Rounding { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: rounding is not positive